assets/umls/adapter-pattern.puml
@startuml

class client

interface ITarget {
  request()
}

class Adapter {
  request()
}

class Adaptee {
  specificRequest()
}

client -> ITarget
ITarget <|-- Adapter
Adapter -> Adaptee

@enduml
